In [1]:
import pandas as pd
import numpy as np
data = pd.read_csv("customers.csv")
df = pd.DataFrame(data)
df

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [2]:

df.columns

Index(['CustomerID', 'Name', 'Age', 'City'], dtype='object')

In [3]:
df.head()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [4]:
df.tail()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         4 non-null      float64
 3   City        4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [6]:
df.describe()

       CustomerID        Age
count    5.000000   4.000000
mean     3.000000  33.750000
std      1.581139   8.539126
min      1.000000  25.000000
25%      2.000000  28.750000
50%      3.000000  32.500000
75%      4.000000  37.500000
max      5.000000  45.000000

In [7]:
np.shape(df)

(5, 4)

In [8]:
df['Age'].fillna(df['Age'],inplace=True)
df

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [9]:
type[df['Name']]

type[0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object]

In [10]:
np.median(df['Age'])

nan